{
  "HomePage": {
    "name": "Jose Navarro",
    "tagline": "I transform data into intelligent models that drive decisions, automation, and real value.",
    "title1": "Electronic Engineer",
    "title2": "Data Scientist",
    "title3": "Software Developer",
    "title4": "Machine Learning Engineer",
    "projects": "Projects",
    "info": "About me",
    "contact": "Contact",
    "blog": "blog"
  },
  "AboutPage": {
    "title": "About me",
    "description1": "I am a professional electronic engineer with a strong affinity for software engineering and a deep passion for building robust, intelligent, and impactful digital systems. My work bridges software engineering, data science, and IoT, and I thrive at the intersection of hardware and high-level applications.",
    "description2": "Over the years, I have developed full-stack applications for mobile, web, and desktop using Flutter, integrating them with real-time IoT devices and scalable backend systems powered by MongoDB. I enjoy owning the entire product development lifecycle — from architecture and development to deployment and user-centered iteration.",
    "description3": "As a Machine Learning Engineer, I’ve also designed recommendation systems and deployed predictive models using FastAPI, always aiming for seamless integration between data and user experience. I value clean code, intelligent systems, and thoughtful design as much as the real-world impact my work can have.",
    "description4": "Beyond the technical aspects, I’m driven by curiosity and a genuine love for learning. I’m especially fascinated by the convergence of software, hardware, data, and automation — areas in which I constantly seek to deepen my expertise. When I’m not coding, you’ll find me exploring new technologies, reading AI papers, or working on personal projects that blend hardware and code.",
    "title1": "Electronic Engineer",
    "title2": "Data Scientist",
    "title3": "RPA Developer",
    "title4": "Machine Learning Engineer",
    "dategrade": "Aug 2019 - Dec 2024",
    "certificates": "Professional Certificates",
    "experiences": "Experience",
    "exp1": "Full Stack Cross-Platform Developer with IoT Focus",
    "exp1_descr": "I designed and developed a comprehensive tech solution aimed at preventing physiological risks in work environments, building a mobile, web, and desktop application using Flutter. I integrated this solution with a real-time IoT device that collected physiological data, managing its efficient storage using MongoDB. Additionally, I implemented interactive data visualizations to facilitate user interpretation. I led all stages of MVP development, from requirement definition to validation, prioritizing features through an iterative, user-experience-driven approach.",
    "exp1_skills": "Flutter, MongoDB, IoT, Full Stack, Cross-platform, REST API, Data Visualization, MVP, UX/UI, Interactive Charts, Multiplatform Development, Agile Development",
    "exp2_skills": "Python, FastAPI, Machine Learning, REST API, E-commerce, JSON, Data Validation, Client-Server Communication, Recommender Systems, MVP, Frontend-Backend Integration, Cross-functional Collaboration",
    "date1": "Sep 2023 - Feb 2024",
    "exp2": "Machine Learning Intern",
    "date2": "Nov 2024 - Apr 2025",
    "exp2_descr": "As an intern, I developed a web-based recommendation system using Machine Learning to personalize the user experience in an e-commerce setting. I built a REST API with FastAPI to serve predictive models, integrating backend and frontend into a seamless interface using optimized JSON structures. I actively contributed to the functional design of the MVP, applying user testing and business feedback to iterate on the product. I collaborated with both technical and non-technical teams, clearly communicating the scope and limitations of the implemented models.",
    "university": "University of Magdalena",
    "empre1": "Ladys Confecciones",
    "contact": "Contact",
    "education": "Education",
    "footer_contact_phrase": "Every great project starts with a conversation. You can contact me at"
  },
  "Contact": {
    "contact": "Contact",
    "email": "Mail",
    "socialmedia": "Social Medias"
  }
}
