{
  "HomePage": {
    "name": "Jose Navarro",
    "tagline": "Transformo datos en modelos inteligentes que impulsan decisiones, automatización y valor real.",
    "title1": "Ingeniero electrónico",
    "title2": "Científico de datos",
    "title3": "Desarrollador de Software",
    "title4": "Ingeniero Machine Learning",
    "projects": "Proyectos",
    "info": "Sobre mí",
    "contact": "Contacto",
    "blog": "blog"
  },
  "AboutPage": {
    "title": "Acerca de mí",
    "description1": "Soy ingeniero electrónico profesional con una fuerte afinidad en la ingeniería de software y una profunda pasión por construir sistemas digitales sólidos, inteligentes y con impacto. Mi trabajo conecta la ingeniería de software, la ciencia de datos y el IoT, y me desenvuelvo con soltura en la intersección entre el hardware y las aplicaciones de alto nivel.",
    "description2": "A lo largo de los años, he desarrollado aplicaciones full stack para móvil, web y escritorio utilizando Flutter, integrándolas con dispositivos IoT en tiempo real y sistemas backend escalables con MongoDB. Disfruto asumir el ciclo completo de desarrollo de un producto: desde la arquitectura y el desarrollo hasta el despliegue y la iteración centrada en el usuario.",
    "description3": "Como ingeniero de Machine Learning, también he diseñado sistemas de recomendación y desplegado modelos predictivos usando FastAPI, siempre con el objetivo de lograr una integración fluida entre los datos y la experiencia del usuario. Valoro el código limpio, los sistemas inteligentes y el diseño cuidadoso tanto como el impacto real que puede tener mi trabajo.",
    "description4": "Más allá de lo técnico, me impulsa la curiosidad y un auténtico amor por el aprendizaje. Me fascina especialmente la convergencia entre software, hardware, datos y automatización — áreas en las que busco profundizar constantemente. Cuando no estoy programando, suelo estar explorando nuevas tecnologías, leyendo artículos sobre IA o trabajando en proyectos personales que combinan hardware y código.",
    "title1": "Ingeniero electrónico",
    "title2": "Científico de datos",
    "title3": "Desarrollador RPA",
    "title4": "Ingeniero Machine Learning",
    "dategrade": "Ago 2019 - Dic 2024",
    "certificates": "Certificados Profesionales",
    "experiences": "Experiencia",
    "exp1": "Desarrollador Full Stack Multiplataforma con Enfoque IoT",
    "exp1_descr": "Diseñé y desarrollé una solución tecnológica integral orientada a la prevención de riesgos fisiológicos en entornos laborales, construyendo una aplicación móvil, web y de escritorio con Flutter. Integré esta solución con un dispositivo IoT que recopilaba datos fisiológicos en tiempo real, gestionando su almacenamiento eficiente mediante MongoDB. Además, implementé visualizaciones interactivas para facilitar la interpretación de los datos por parte del usuario final. Lideré todas las etapas del desarrollo del MVP, desde la definición de requerimientos hasta su validación, priorizando funciones con un enfoque iterativo basado en la experiencia del usuario.",
    "exp1_skills": "Flutter, MongoDB, IoT, Full Stack, Cross-platform, REST API, Visualización de datos, MVP, UX/UI, Gráficas interactivas, Desarrollo multiplataforma, Desarrollo ágil",
    "exp2_skills": "Python, FastAPI, Machine Learning, API REST, E-commerce, JSON, Validación de datos, Comunicación cliente-servidor, Recomendadores, MVP, Frontend-Backend Integration, Colaboración multidisciplinaria",
    "date1": "Sep 2023 - Feb 2024",
    "exp2": "Machine Learning (Pasante)",
    "date2": "Nov 2024 - Abr 2025",
    "exp2_descr": "Como pasante, desarrollé un sistema de recomendación web basado en Machine Learning para personalizar la experiencia en un entorno e-commerce. Construí una API REST con FastAPI para servir modelos predictivos, integrando backend y frontend en una interfaz funcional y conectada mediante estructuras JSON optimizadas. Participé activamente en el diseño funcional del MVP, aplicando pruebas de usuario y retroalimentación del negocio para iterar sobre el producto. Colaboré con equipos técnicos y no técnicos, comunicando de forma clara el alcance y las limitaciones de los modelos implementados.",
    "university": "Universidad del Magdalena",
    "empre1": "Ladys Confecciones",
    "contact": "Contacto",
    "education": "Educación",
    "footer_contact_phrase": "Cada gran proyecto comienza con una conversación. Puedes contactarme en"
  },
  "Contact": {
    "contact": "Contáctame",
    "email": "E-mail",
    "socialmedia": "Redes Sociales"
  }
}
